constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (siliconoil air);

siliconoil
{
 rho rho [1 -3 0 0 0 0 0] 920;
    transportModel powerLaw;
    powerLawCoeffs
{
    nuMax    [ 0 2 -1 0 0 0 0 ] 0.012896739;
    nuMin    [ 0 2 -1 0 0 0 0 ] 0.00087163;
    k        [ 0 2 -1 0 0 0 0 ] 1.28512;
    n        [ 0 0  0 0 0 0 0 ] 0.2;
}
}
air
{
    transportModel  Newtonian;
    nu              0.000015;
    rho             1.2;
}

sigma           0.0187;


// ************************************************************************* //
