system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
convertToMeters 0.001; //scale
r1 4.25;// internal box for improved meshing
r2 4.5;// nozzle radius

x1 #calc "(0.707*($r1))";// inner box coordinates
x2 #calc "(-0.707*($r1))";
z1 #calc "(0.707*($r1))";
z2 #calc "(-0.707*($r1))";



x3 #calc "(0.707*($r2))";// nozzle coordinates
x4 #calc "(-0.707*($r2))";
z3 #calc "(0.707*($r2))";
z4 #calc "(-0.707*($r2))";



x5 7.5;
x6 -7.5;
z5 7.5;
z6 -7.5;


x7 10;
x8 -10;
z7 10;
z8 -10;



y1 -20;
y2 -25;
y3 -105;


dx0 0.5;
dx 0.5;
dy 0.5;
dz 0.5;
dz0 0.5;

d #calc "abs((($x1)*2)/$dx)";
dr1 #calc "abs(((($r2)-($r1))*6)/$dx)";

dx1 #calc "abs((($x4)-($x6))/$dx)";
dz1 #calc "abs((($z4)-($z6))/$dz)";

dx2 #calc "abs((($x7)-($x3))/$dx0)";
dz2 #calc "abs((($z7)-($z3))/$dz0)";


dy1 #calc "abs(($y1)/($dy))";
dy2 #calc "abs((($y1)-($y2))/($dy))";
dy3 #calc "abs((($y3)-($y2))/($dy))";
vertices
(
    ($x2 0 $z2)//0
    ($x1 0 $z2)//1
    ($x1 0 $z1)//2
    ($x2 0 $z1)//3

    ($x4 0 $z4)//4
    ($x3 0 $z4)//5
    ($x3 0 $z3)//6  
    ($x4 0 $z3)//7 

    ($x2 $y1 $z2)//8
    ($x1 $y1 $z2)//9
    ($x1 $y1 $z1)//10
    ($x2 $y1 $z1)//11
    
    ($x4 $y1 $z4)//12
    ($x3 $y1 $z4)//13
    ($x3 $y1 $z3)//14 
    ($x4 $y1 $z3)//15
    
    ($x2 $y2 $z2)//16
    ($x1 $y2 $z2)//17
    ($x1 $y2 $z1)//18
    ($x2 $y2 $z1)//19
    
    ($x4 $y2 $z4)//20
    ($x3 $y2 $z4)//21
    ($x3 $y2 $z3)//22 
    ($x4 $y2 $z3)//23
    
    ($x2 $y3 $z2)//24
    ($x1 $y3 $z2)//25
    ($x1 $y3 $z1)//26
    ($x2 $y3 $z1)//27

    ($x4 $y3 $z4)//28
    ($x3 $y3 $z4)//29
    ($x3 $y3 $z3)//30 
    ($x4 $y3 $z3)//31 

    ($x6 0 $z6)//32
    ($x4 0 $z6)//33
    ($x3 0 $z6)//34
    ($x5 0 $z6)//35
    ($x5 0 $z4)//36
    ($x5 0 $z3)//37
    ($x5 0 $z5)//38
    ($x3 0 $z5)//39
    ($x4 0 $z5)//40
    ($x6 0 $z5)//41
    ($x6 0 $z3)//42
    ($x6 0 $z4)//43

    ($x6 $y1 $z6)//44
    ($x4 $y1 $z6)//45
    ($x3 $y1 $z6)//46
    ($x5 $y1 $z6)//47
    ($x5 $y1 $z4)//48
    ($x5 $y1 $z3)//49
    ($x5 $y1 $z5)//50
    ($x3 $y1 $z5)//51
    ($x4 $y1 $z5)//52
    ($x6 $y1 $z5)//53
    ($x6 $y1 $z3)//54
    ($x6 $y1 $z4)//55

    ($x8 $y2 $z8)//56
    ($x4 $y2 $z8)//57
    ($x3 $y2 $z8)//58
    ($x7 $y2 $z8)//59
    ($x7 $y2 $z4)//60
    ($x7 $y2 $z3)//61
    ($x7 $y2 $z7)//62
    ($x3 $y2 $z7)//63
    ($x4 $y2 $z7)//64
    ($x8 $y2 $z7)//65
    ($x8 $y2 $z3)//66
    ($x8 $y2 $z4)//67
    
    ($x8 $y3 $z8)//68
    ($x4 $y3 $z8)//69
    ($x3 $y3 $z8)//70
    ($x7 $y3 $z8)//71
    ($x7 $y3 $z4)//72
    ($x7 $y3 $z3)//73
    ($x7 $y3 $z7)//74
    ($x3 $y3 $z7)//75
    ($x4 $y3 $z7)//76
    ($x8 $y3 $z7)//77
    ($x8 $y3 $z3)//78
    ($x8 $y3 $z4)//79

);
blocks
( 
   hex (0 1 2 3 8 9 10 11) ($d $d $dy1) simpleGrading (1 1 1)//0   
   hex (4 0 3 7 12 8 11 15) ($dr1 $d $dy1) simpleGrading (1 1 1)//1
   hex (7 3 2 6 15 11 10 14) ($dr1 $d $dy1) simpleGrading (1 1 1)//2
   hex (10 14 13 9 2 6 5 1) ($dr1 $d $dy1) simpleGrading (1 1 1)//3
   hex (9 13 12 8 1 5 4 0) ($dr1 $d $dy1) simpleGrading (1 1 1)//4
   
   hex (8 9 10 11 16 17 18 19) ($d $d $dy2) simpleGrading (1 1 1)//5
   hex (12 8 11 15 20 16 19 23) ($dr1 $d $dy2) simpleGrading (1 1 1)//6
   hex (19 23 22 18 11 15 14 10) ($dr1 $d $dy2) simpleGrading (1 1 1)//7
   hex (18 22 21 17 10 14 13 9) ($dr1 $d $dy2) simpleGrading (1 1 1)//8
   hex (17 21 20 16 9 13 12 8) ($dr1 $d $dy2) simpleGrading (1 1 1)//9 
   
   hex (16 17 18 19 24 25 26 27) ($d $d $dy3) simpleGrading (1 1 1)//10
   hex (20 16 19 23 28 24 27 31) ($dr1 $d $dy3) simpleGrading (1 1 1)//11
   hex (23 19 18 22 31 27 26 30) ($dr1 $d $dy3) simpleGrading (1 1 1)//12
   hex (26 30 29 25 18 22 21 17) ($dr1 $d $dy3) simpleGrading (1 1 1)//13
   hex (25 29 28 24 17 21 20 16) ($dr1 $d $dy3) simpleGrading (1 1 1)//14   

   hex (32 33 4 43 44 45 12 55) ($dx1 $dz1 $dy1) simpleGrading (1 1 1)//28
   hex (33 34 5 4 45 46 13 12) ($d $dz1 $dy1) simpleGrading (1 1 1)//29
   hex (34 35 36 5 46 47 48 13) ($dx1 $dz1 $dy1) simpleGrading (1 1 1)//30
   hex (5 36 37 6 13 48 49 14) ($dx1 $d $dy1) simpleGrading (1 1 1)//31
   hex (6 37 38 39 14 49 50 51) ($dx1 $dz1 $dy1) simpleGrading (1 1 1)//32
   hex (7 6 39 40 15 14 51 52) ($d $dz1 $dy1) simpleGrading (1 1 1)//33
   hex (42 7 40 41 54 15 52 53) ($dx1 $dz1 $dy1) simpleGrading (1 1 1)//34
   hex (43 4 7 42 55 12 15 54) ($dx1 $d $dy1) simpleGrading (1 1 1)//35

   hex (56 57 20 67 68 69 28 79) ($dx2 $dz2 $dy3) simpleGrading (1 1 1)//36
   hex (57 58 21 20 69 70 29 28) ($d $dz2 $dy3) simpleGrading (1 1 1)//37
   hex (58 59 60 21 70 71 72 29) ($dx2 $dz2 $dy3) simpleGrading (1 1 1)//38
   hex (21 60 61 22 29 72 73 30) ($dx2 $d $dy3) simpleGrading (1 1 1)//39
   hex (22 61 62 63 30 73 74 75) ($dx2 $dz2 $dy3) simpleGrading (1 1 1)//40
   hex (23 22 63 64 31 30 75 76) ($d $dz2 $dy3) simpleGrading (1 1 1)//41
   hex (66 23 64 65 78 31 76 77) ($dx2 $dz2 $dy3) simpleGrading (1 1 1)//42
   hex (67 20 23 66 79 28 31 78) ($dx2 $d $dy3) simpleGrading (1 1 1)//43
);
edges
(
   arc 7 6 (0 0 4.5)
   arc 6 5 (4.5 0 0)
   arc 5 4 (0 0 -4.5)
   arc 4 7 (-4.5 0 0)
   
   arc 15 14 (0 $y1 4.5)
   arc 14 13 (4.5 $y1 0)
   arc 13 12 (0 $y1 -4.5)
   arc 12 15 (-4.5 $y1 0)
   
   arc 23 22 (0 $y2 4.5)
   arc 22 21 (4.5 $y2 0)
   arc 21 20 (0 $y2 -4.5)
   arc 20 23 (-4.5 $y2 0)

   arc 31 30 (0 $y3 4.5)
   arc 30 29 (4.5 $y3 0)
   arc 29 28 (0 $y3 -4.5)
   arc 28 31 (-4.5 $y3 0)
);
boundary
(
staticsurface
    {
        type wall;
        faces
        (
            (24 25 26 27)
            (28 24 27 31)
            (27 26 30 31)
            (26 30 29 25)
            (24 25 29 28)
            (68 69 28 79)
            (69 70 29 28)
            (70 71 72 29)
            (29 30 73 72)
            (30 73 74 75)
            (31 30 75 76)
            (31 76 77 78)
            (78 79 28 31)
        );
    }
tank
    {
        type wall;
        faces
        (
            (41 42 54 53)
            (42 43 55 54)
            (43 32 44 55)
            (41 40 52 53)  
            (40 39 51 52)
            (39 38 50 51)
            (38 37 49 50)
            (37 36 48 49)
            (36 35 47 48)
            (32 33 45 44)
            (33 34 46 45)
            (34 35 47 46)     
            (15 52 53 54)
            (14 15 52 51)
            (14 49 50 51)
            (13 14 49 48)
            (13 46 47 48)
            (12 13 46 45)
            (44 45 12 55)
            (12 15 54 55)
            (15 14 22 23)
            (14 13 21 22)
            (12 13 21 20)
            (15 12 20 23)
            (23 64 65 66)
            (23 22 63 64)
            (22 61 62 63)
            (21 22 61 60)
            (21 58 59 60)
            (20 21 58 57)
            (56 57 20 67)
            (20 23 66 67)
        );
    }
openatmosphere
    {
        type patch;
        faces
        (
            (0 1 2 3)
            (4 0 3 7)
            (3 7 6 2)
            (2 6 5 1)
            (0 1 5 4)
            (32 33 4 43)
            (33 34 5 4)
            (34 35 36 5)
            (5 36 37 6)
            (6 37 38 39)
            (7 6 39 40)
            (7 40 41 42)
            (4 7 42 43)
            (65 66 78 77)
            (66 67 79 78)
            (67 56 68 79)
            (65 64 76 77)
            (64 63 75 76)
            (63 62 74 75)
            (62 61 73 74)
            (61 60 72 73)
            (60 59 71 72)
            (56 57 69 68)
            (57 58 70 69)
            (58 59 71 70)
        );
    }
);
mergePatchPairs
(
);
// ************************************************************************* //
